"""
Иммитация игры в кости
Правила очень просты: сначала определяется значение n — количество раундов игры.
В очередном раунде каждый из игроков один раз бросает стандартный игральный кубик,
на грани которого нанесены различные числа от 1 до 6.
Игрок, выбросивший большее значение, становится победителем в раунде.
В случае, если выпавшие значения равны, победа не засчитывается никому.

В самой же игре побеждает участник, выигравший в большем количестве раундов.
Если же количества побед, заслуженных игроками, равны, то объявляется ничья.

Вход:
3
3 5
2 1
4 2

Выход:
Player 1
"""