"""
Программа получает на вход строку.
Выведите каждый третий символ строки в обратном порядке, начиная с последнего.
"""

print(input()[::-1][::3])
