"""
Дан квадрат с длиной стороны а см. Рассчитайте площадь фигуры.
Используйте функцию стандартного ввода input() для инициализации переменной.
На выходе отформатируйте строку, чтобы выводилась фраза "Площадь квадрата b см.кв."
"""

a = int(input('Введите сторону квадрата '))
f = a ** 2
print(f'Площадь квадрата {f} см. кв.')
