"""
Дано натуральное число N, вывести все натуральные числа от 1 до N.
"""


def get_numbers(n: int, current=1):
    pass


print(get_numbers(5))