"""
Напишите программу, которая определяет количество различных символов, встречающихся в символьной строке.

Вход: aB122AB159ibt
Выход: 5
"""

print(len(set(input())))
