"""
Написать анонимную функцию для вычисления площади прямоугольника
"""

print((lambda x, y: x * y)(3, 5))
