"""
Написать программу, которая вырезает из фразы "I like ITstep" слово "ITstep".
Найти длину этого слова
"""

text = "I like ITstep"
word = text[7:]
print(word, len(word))
